# Descriptive statistics, wrangling and consistency check

### 1. Import libraries

### 2. Import data

### 3. Consistensy checks
  <ul>
<li>3.1 Checking for mixed data types</li>
 <li>3.2 Checking for missing values</li>
 <li>3.3 Checking for duplicates</li>
  </ul>

### 4. Wrangling data
  <ul>
<li>4.1 Replace value</li>
  </ul>

### 5. Export data

# 1. Import libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 2. Import data

In [2]:
# Create a path

path = r'/Users/marie/Documents/CareerFoundry/11-2021 City Temperatures'

In [3]:
# Import data

df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'city_temperature.csv'))

/Users/marie/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3165: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [4]:
# Print head

df.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [5]:
# Print tail

df.tail()

,Region,Country,State,City,Month,Day,Year,AvgTemperature
2906322,North America,US,Additional Territories,San Juan Puerto Rico,7,27,2013,82.4
2906323,North America,US,Additional Territories,San Juan Puerto Rico,7,28,2013,81.6
2906324,North America,US,Additional Territories,San Juan Puerto Rico,7,29,2013,84.2
2906325,North America,US,Additional Territories,San Juan Puerto Rico,7,30,2013,83.8
2906326,North America,US,Additional Territories,San Juan Puerto Rico,7,31,2013,83.6

In [6]:
# Print shape

df.shape

(2906327, 8)

#### Since the column "State" includes a lot of NaN, and it's needless for this analysis (I have region, country and city), I decided to drop the column.

In [7]:
# Dropping "State" column from df

df = df.drop(columns = ['State'])

In [8]:
# Print df after dropping column

df.head()

   Region  Country     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria  Algiers      1    1  1995            64.2
1  Africa  Algeria  Algiers      1    2  1995            49.4
2  Africa  Algeria  Algiers      1    3  1995            48.8
3  Africa  Algeria  Algiers      1    4  1995            46.4
4  Africa  Algeria  Algiers      1    5  1995            47.9

In [9]:
# Print shape after dropping column

df.shape

(2906327, 7)

# 3. Data Consistency Checks

### 3.1 Checking for mixed data types

In [10]:
#Checking for columns with mixed data types

for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col)

### 3.2 Checking for missing values

In [11]:
# Checking for missing values in df.

df.isnull().sum()

Region            0
Country           0
City              0
Month             0
Day               0
Year              0
AvgTemperature    0
dtype: int64

#### There are no missing values in the dataframe.

### 3.3 Checking for duplicates

In [13]:
#Looking for duplicates in df (creating a new subset containing only duplicates)

df_dups = df[df.duplicated()]

In [14]:
#Print df_dups

df_dups

                Region  Country        City  Month  Day  Year  AvgTemperature
742977          Europe  Germany     Hamburg     12    9  2007           -99.0
742983          Europe  Germany     Hamburg     12   15  2007           -99.0
742984          Europe  Germany     Hamburg     12   16  2007           -99.0
742990          Europe  Germany     Hamburg     12   22  2007           -99.0
742991          Europe  Germany     Hamburg     12   23  2007           -99.0
...                ...      ...         ...    ...  ...   ...             ...
2841036  North America       US  Charleston      5   22  2012            67.9
2841063  North America       US  Charleston      6   18  2012            73.2
2841358  North America       US  Charleston      4    9  2013            69.8
2841701  North America       US  Charleston      3   18  2014            42.8
2843682  North America       US  Charleston      8   20  2019            81.5

[20903 rows x 7 columns]

#### This is no duplicates since the "Day" differ. The other columns are the same.

In [15]:
# Print basic statistics after consistensy checks.

df.describe()

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.906327e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    5.600492e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    3.212359e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.580000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.250000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.550000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

#### The AvgTemperature is in Fahrenheit, and the minimum temperature can not be -99.0 (-73 C). After reading the comments on Kaggle I found out that -99 value is instead of NaN.

# 4. Wrangling data

### 4.1 Replace value

In [16]:
# Replace the -99.0 to NaN

df['AvgTemperature'].replace(-99.0, np.nan, inplace=True)

In [17]:
# Check the minimum value after replacing -99.0

df.min()

Region             Africa
Country           Albania
City              Abidjan
Month                   1
Day                     0
Year                  200
AvgTemperature      -50.0
dtype: object

#### The minimum temperature is no longer -99.0

In [18]:
# Check basic statistics after replacing -99.0

df.describe()

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.826655e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    6.037388e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    1.909744e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -5.000000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.740000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.330000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.590000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

#### Now it looks more correct. 
The average temperature is -50 F (-45,5 C) as minimum, and 110 F (43,3 C) as maximum.
The mean is 60 F (15,5 C).

### 4.2 Drop values in column

In [19]:
# Check the column "Year" since the miminum year 200 not seems to be correct.

df['Year'].value_counts().sort_index(ascending=False)

2020     38810
2019    106337
2018    106698
2017    106946
2016    107237
2015    107498
2014    109018
2013    111021
2012    111993
2011    113740
2010    115627
2009    114247
2008    114908
2007    115428
2006    117647
2005    117895
2004    118645
2003    119140
2002    119355
2001    119355
2000    119682
1999    119355
1998    119082
1997    118656
1996    118951
1995    118616
201        351
200         89
Name: Year, dtype: int64

#### Year 201 and 200 seems to be a typing error.  Since they are outliners I decide to delete them. I also want to delete year 2020 since it does not seem to be complete.

In [20]:
# Drop value 200 in column Year

df.drop(df.index[df['Year'] == 200], inplace=True)

In [21]:
# Drop value 201 in column Year

df.drop(df.index[df['Year'] == 201], inplace=True)

In [22]:
# Drop value 2020 in column Year

df.drop(df.index[df['Year'] == 2020], inplace=True)

In [23]:
# Print value counts after dropping 200,201 and 2020

df['Year'].value_counts().sort_index(ascending=False)

2019    106337
2018    106698
2017    106946
2016    107237
2015    107498
2014    109018
2013    111021
2012    111993
2011    113740
2010    115627
2009    114247
2008    114908
2007    115428
2006    117647
2005    117895
2004    118645
2003    119140
2002    119355
2001    119355
2000    119682
1999    119355
1998    119082
1997    118656
1996    118951
1995    118616
Name: Year, dtype: int64

# 5. Export data

In [25]:
#Export df to Prepared Data

df.to_csv(os.path.join(path, '02 Data','Prepared Data', 'city_temperatures_clean.csv'))